#+title: Testing
#+PROPERTY: header-args:java :results output :exports both


Then show them again how it works from a memory perspective (draw the picture).

#+BEGIN_SRC java :results output
class Hmm {
    public static int mystery(int n) {
        if (n==1) {
            return 2;
        } else {
            return 7 + mystery(n-1);
        }
    }

    public static void main(String[] args) {
        System.out.println(mystery(3));
    }
}
#+END_SRC

#+RESULTS:
: 16
